{"backend": "tensorflow", "config": [{"config": {"trainable": true, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "conv2d_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [2, 2], "batch_input_shape": [null, 224, 224, 3], "filters": 32, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "conv2d_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [2, 2], "filters": 32, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "conv2d_3", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [2, 2], "filters": 64, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_1", "units": 64, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_2", "units": 3, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_5"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.1.3"}